In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import zscore, iqr

In [4]:
data= pd.read_csv("Student.CSV")

In [5]:
data.head()

   No.    Name   Roll No.  Marks  Grade
0    1     John     101.0     400      A
1    2    Alice     102.0     411      A
2    3      Bob       NaN     300    NaN
3    4  Charlie     104.0     329   NUll
4    5    David     105.0     467      B

In [7]:
data.isnull().sum()

No.          0
Name         0
Roll No.    12
Marks        0
Grade        5
dtype: int64

In [9]:
df2 = data.copy()

In [10]:
for col in data.columns:
    if df2[col].isnull().any() and df2[col].dtype in ['int64', 'float64']:
        df2[col] = df2[col].fillna(df2[col].mean())

In [11]:
df2.isnull().sum()

No.         0
Name        0
Roll No.    0
Marks       0
Grade       5
dtype: int64

In [ ]:
df3 = data.copy()
for col in data.columns:
    if df3[col].isnull().any():
        df3[col] = df3[col].ffill()
df3.isnull().sum()